Autodesk.Revit.DB.DesignOption.GetActiveDesignOptionId(Autodesk.Revit.DB.Document)
Gets the active design option id for the current design option set.
document:
The document.
Returns:
The active design option id. It can be invalid id if there is no active design option in the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DesignOption.IsPrimary
Determines whether this is a primary design option.

Autodesk.Revit.DB.DesignOption
An element that represents a design alternative.
Remarks:
Design options enable the user to add alternative designs within the same project.
Each element can either be in a design option or not at all, in which case it is considered
to be part of the main model and have no design alternatives.